Конфигурация/InformationRegisters/СтатусыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокПайщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаПайщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыЗаявокПайщиков/Ext/ManagerModule.bsl
Процедура УстановитьСтатусЗаявки(Организация, ЗаявкаПайщика, НовыйСтатус, Период, Отказ = Ложь) Экспорт
	
	Попытка
		
		Блокировка				= Новый БлокировкаДанных;
		ЭлементБлокировки		= Блокировка.Добавить(Метаданные.РегистрыСведений.СтатусыЗаявокПайщиков.ПолноеИмя());
		ЭлементБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("Организация", 	Организация);
		ЭлементБлокировки.УстановитьЗначение("ЗаявкаПайщика",	ЗаявкаПайщика);
		                        
		Блокировка.Заблокировать();
        		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗаявокПайщиковСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыЗаявокПайщиков.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ЗаявкаПайщика = &ЗаявкаПайщика) КАК СтатусыЗаявокПайщиковСрезПоследних");
			
		Запрос.УстановитьПараметр("Период",			Период);
		Запрос.УстановитьПараметр("ЗаявкаПайщика",	ЗаявкаПайщика);
		Запрос.УстановитьПараметр("Организация", 	Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		// Проверяем текущий статус
		Если Выборка.Следующий() Тогда
			Если Выборка.Статус = НовыйСтатус Тогда
				Возврат;
			ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявокПайщиков.Исполнена Тогда
				// Это конечный статус, его не меняем
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Запрещено изменять статус '%1' документа %2", Выборка.Статус, ЗаявкаПайщика), ЗаявкаПайщика,,, Отказ);
				Возврат;		
			КонецЕсли;
		КонецЕсли;
				
		МенеджерЗаписи					= РегистрыСведений.СтатусыЗаявокПайщиков.СоздатьМенеджерЗаписи();
	    МенеджерЗаписи.Период			= Период;
		МенеджерЗаписи.Организация		= Организация;
		МенеджерЗаписи.ЗаявкаПайщика	= ЗаявкаПайщика;
		МенеджерЗаписи.Статус			= НовыйСтатус;
		
		МенеджерЗаписи.Записать(Истина);
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ЗаявкаПайщика,,, Отказ);
	КонецПопытки;	
		
КонецПроцедуры
